@echo off
chcp 65001 >nul
cls

echo.
echo [91m░█████╗░██╗░░░░░░█████╗░░██████╗██╗░░██╗
echo ██╔══██╗██║░░░░░██╔══██╗██╔════╝██║░░██║
echo ██║░░╚═╝██║░░░░░███████║╚█████╗░███████║
echo ██║░░██╗██║░░░░░██╔══██║░╚═══██╗██╔══██║
echo ╚█████╔╝███████╗██║░░██║██████╔╝██║░░██║
echo ░╚════╝░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░░╚═╝

echo ░█████╗░███████╗
echo ██╔══██╗██╔════╝
echo ██║░░██║█████╗░░
echo ██║░░██║██╔══╝░░
echo ╚█████╔╝██║░░░░░
echo ░╚════╝░╚═╝░░░░░

echo ░█████╗░██╗░░░░░░█████╗░███╗░░██╗░██████╗
echo ██╔══██╗██║░░░░░██╔══██╗████╗░██║██╔════╝
echo ██║░░╚═╝██║░░░░░███████║██╔██╗██║╚█████╗░
echo ██║░░██╗██║░░░░░██╔══██║██║╚████║░╚═══██╗
echo ╚█████╔╝███████╗██║░░██║██║░╚███║██████╔╝
echo ░╚════╝░╚══════╝╚═╝░░╚═╝╚═╝░░╚══╝╚═════╝░

echo.
echo [92mПривет! Я помогу установить все зависимости в виртуальное окружение. Нажми любую клавишу для продолжения...
pause >nul

:: Создаем виртуальное окружение
echo [96m1/4 Создаю виртуальное окружение...
python -m venv .venv

:: Активируем виртуальное окружение
call .venv\Scripts\activate

echo [96m2/4 Устанавливаю базовые зависимости...
pip install -r requirements.txt

echo [93mХотите использовать GPU для ускорения? (y/n):
set /p use_gpu=
if /i "%use_gpu%"=="y" (
    echo [96m3/4 Устанавливаю поддержку GPU...
    if "%OS_NAME%"=="Windows" (
        pip install paddlepaddle-gpu==2.6.2 paddleocr -f https://www.paddlepaddle.org.cn/whl/windows/mkl/avx/stable.html
    ) else (
        pip install paddlepaddle-gpu==2.6.2 paddleocr -f https://www.paddlepaddle.org.cn/whl/linux/mkl/avx/stable.html
    )
) else (
    echo [93mПропускаю установку GPU.
)

echo [92m4/4 Установка завершена!
pause
